# Python: Resumen del lenguaje, sintaxis y utilización

## Variables & tipos de datos

In [1]:
myInt = 3
type(myInt)

int

In [2]:
myfloat = 7.0
myfloat = float(7)
myfloat

7.0

In [3]:
hello_single = 'Hola'
hello_double = "Hola"

micadena = "No te preocupes de los \"apostofres\" usando comillas dobles"

micadena

'No te preocupes de los "apostofres" usando comillas dobles'

__Asignacion multiple__

In [4]:
x, y = 3, 4.5

print(x)
print(y)

3
4.5

In [5]:
for idx, value in enumerate(range(10)):
    print(idx)
    print(f"valor en la lista {value*2+12}")

0
valor en la lista 12
1
valor en la lista 14
2
valor en la lista 16
3
valor en la lista 18
4
valor en la lista 20
5
valor en la lista 22
6
valor en la lista 24
7
valor en la lista 26
8
valor en la lista 28
9
valor en la lista 30

## Operadores ##

In [6]:
print(type(x))
print(type(y))

<class 'int'>
<class 'float'>

In [7]:
print(x + 1)   # Addition;
print(x - 1)   # Subtraction;
print(x * 2)   # Multiplication;
print(x ** 2)  # Exponentiation;

4
2
6
9

In [8]:
x += 1
print(x)
x *= 2
print(x)

4
8

No existe en python el incremento/decremento unario!
``` python
x++
```

In [9]:
'a' + ' ' + 'b'

'a b'

In [10]:
print(micadena)
len(micadena)

No te preocupes de los "apostofres" usando comillas dobles

58

In [11]:
'%s %s @ %d' % (hello_single.capitalize(),hello_double.upper(), 12)

'Hola HOLA @ 12'

In [12]:
"{:.2}".format(1.223)

'1.2'

In [13]:
print(hello_double.replace('ol', '_'))
print(hello_double.rjust(10) + '.')
print(hello_double.ljust(10) + '.')
print(hello_double.center(10) + '.')

H_a
      Hola.
Hola      .
   Hola   .

## Listas ##

In [14]:
unalista = [0]
unalista.append(1)
unalista.append(2)
unalista.append(3)
print(unalista[0]) # imprime 1
print(unalista[1]) # imprime 2
print(unalista[2]) # imprime 3

# prints out 1,2,3
for x in unalista:
    print ('loop', x)

0
1
2
loop 0
loop 1
loop 2
loop 3

In [15]:
nums = list(range(5))     # Range es un objeto iterable.
nums

[0, 1, 2, 3, 4]

In [16]:
print(nums[0:4])

[0, 1, 2, 3]

In [17]:
print(nums[2:])
print(nums[:2])

[2, 3, 4]
[0, 1]

In [18]:
print(nums[:])

[0, 1, 2, 3, 4]

In [19]:
nums[2:3]

[2]

In [20]:
nums[2:3] = [0, 0, 0, 0, 0]

nums

[0, 1, 0, 0, 0, 0, 0, 3, 4]

## Sentencias de control & Condicionales ##

__IF__ stament:

<img src="./images/if_statement.png" style="high: 265px">

In [21]:
name = "John"
age = 23

if (name == "John") | (name == "Rick"):
    print("Name is John or maybe rick.")
    
if (name == "John") & (not age == 23):
    print("name is John and age is 23")
else:
    print("name is John but age is not 23")

Name is John or maybe rick.
name is John but age is not 23

Operador __in__:

In [22]:
if name in ["John", "Rick"]:
    print("Name is John or Rick.")

Name is John or Rick.

## Loops ##

In [23]:
primes = [2,3,5,7]
for x in primes:
    print (x)

2
3
5
7

In [24]:
for x in range(3,6): # Idem xrange en versiones anteriores python3.
    print (x)

3
4
5

También existe el `while`:

In [25]:
# Muestra 0,1,2,3,4

count = 0
maximum = 10
while True:
    count += 1
    if count >= maximum:
        break
print("count total:",count)
        
# Muestra solo números impares - 1,3,5,7,9
toShow = []
for x in range(10):
    # Check if x is even
    if x % 2 == 0:
        continue
    toShow.append(x)
    
print("Numeros impares:", toShow)

count total: 10
Numeros impares: [1, 3, 5, 7, 9]

__Compresiones de listas__: que crea una lista basada en otra, en una única linea legible.

In [26]:
list_of_n = [n for n in [1,2,3]]
list_of_n

[1, 2, 3]

In [27]:
toShow = [n for n in range(10) if n % 2 != 0]
toShow

[1, 3, 5, 7, 9]

## Funciones ##

In [28]:
def sum_two_numbers(a, b):
    return a + b

In [29]:
x = sum_two_numbers(1,2)  # after this line x will hold the value 3 !

x

3

## Clases & objetos ##

In [30]:
class Greeter:

    # Constructor
    def __init__(self, name):
        self.name = name  # Create an instance variable

    # Instance method
    def greet(self, loud=False):
        if loud:
            print('HELLO, %s!' % self.name.upper())
        else:
            print('Hello, %s' % self.name)

g = Greeter('Clase')

In [31]:
g.greet()

Hello, Clase

In [32]:
g.greet(loud=True)

HELLO, CLASE!

## Diccionarios & Iteraciones ##

In [33]:
librotelefonico = {
    "Juan" : 938477566,
    "Jack" : 938377264,
    "Jill" : 947662781
}

librotelefonico

{'Juan': 938477566, 'Jack': 938377264, 'Jill': 947662781}

In [34]:
librotelefonico["Jill"] = 0
librotelefonico["Jill"]

0

In [35]:
for item in librotelefonico:
    print("Número telefónico de",item,'es',librotelefonico[item])

Número telefónico de Juan es 938477566
Número telefónico de Jack es 938377264
Número telefónico de Jill es 0

In [36]:
for name, number in librotelefonico.items():
    print("Número telefónico de",name,"es", number)

Número telefónico de Juan es 938477566
Número telefónico de Jack es 938377264
Número telefónico de Jill es 0

## Tuplas ##

- Lista de valores.
- Inmutables.

In [37]:
t = (5, 6)
type(t)

tuple

In [38]:
t

(5, 6)

# Librerías & Importación #

In [39]:
import urllib
import urllib as ulib

In [40]:
help(ulib)

Help on package urllib:

NAME
    urllib

MODULE REFERENCE
    https://docs.python.org/3.8/library/urllib

    The following documentation is automatically generated from the Python
    source files.  It may be incomplete, incorrect or include features that
    are considered implementation detail and may vary between Python
    implementations.  When in doubt, consult the module reference at the
    location listed above.

PACKAGE CONTENTS
    error
    parse
    request
    response
    robotparser

FILE
    /opt/conda/lib/python3.8/urllib/__init__.py

# Numpy #

- Alternativa a las listas de Python.
- Rápidos & eficientes
- Realizar cálculos a través de arrays completos

In [41]:
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

weight

[81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

## Arrays ##

 - grid of values, all of the same type
 - is indexed by a tuple of nonnegative integers.
 - The number of dimensions is the rank of the array; 
 - the shape of an array is a tuple of integers giving the size of the array along each dimension.

In [42]:
import numpy as np

In [43]:
np.array([1,2,3])

array([1, 2, 3])

In [44]:
np.array([[1,2,3],[4,5,6]])

array([[1, 2, 3],
       [4, 5, 6]])

In [45]:
l = range(100)
arr = np.array(l, dtype='int8')

In [46]:
%timeit arr * 2

1.59 µs ± 101 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

In [47]:
arr.dtype

dtype('int8')

In [48]:
%timeit [x*2 for x in l]

8.59 µs ± 2.69 µs per loop (mean ± std. dev. of 7 runs, 100000 loops each)

**Inicializar el array** con valores por default:

In [49]:
np.zeros(3)

array([0., 0., 0.])

In [50]:
np.zeros((4,8))

array([[0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0.]])

In [51]:
np.zeros((1,4,8))

array([[[0., 0., 0., 0., 0., 0., 0., 0.],
        [0., 0., 0., 0., 0., 0., 0., 0.],
        [0., 0., 0., 0., 0., 0., 0., 0.],
        [0., 0., 0., 0., 0., 0., 0., 0.]]])

In [52]:
np.ones((4,4), dtype=int)

array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])

In [53]:
np.full((2,5),"hola")

array([['hola', 'hola', 'hola', 'hola', 'hola'],
       ['hola', 'hola', 'hola', 'hola', 'hola']], dtype='<U4')

In [54]:
np.random.random((2,5))

array([[0.71026101, 0.52864946, 0.69089754, 0.61277764, 0.10196178],
       [0.44974127, 0.47399374, 0.41028848, 0.52108614, 0.64745966]])

Evenly spaced samples, calculated over the interval [start, stop] using... steps:

In [55]:
np.arange(30,100,5)

array([30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95])

...or samples:

In [56]:
np.linspace(30,100,15)

array([ 30.,  35.,  40.,  45.,  50.,  55.,  60.,  65.,  70.,  75.,  80.,
        85.,  90.,  95., 100.])

O una matriz identidad:

In [57]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

Shapes & Dimensions:

In [58]:
a = np.array([['00','01','02','03'],['10','11','12','13'],['30','31','32','33']])
a

array([['00', '01', '02', '03'],
       ['10', '11', '12', '13'],
       ['30', '31', '32', '33']], dtype='<U2')

In [59]:
a.shape

(3, 4)

In [60]:
a[0][3] # probar con 4 en lugar de 0.

'03'

In [61]:
a[0,3]

'03'

In [62]:
a.ndim

2

In [63]:
'%d elementos' % a.size

'12 elementos'

Algunas **operaciones**...

In [64]:
b = np.array([[10,10,10],[10,10,10]])

In [65]:
b

array([[10, 10, 10],
       [10, 10, 10]])

In [66]:
c = np.array([[2,2,2],[7,7,7]])

c

array([[2, 2, 2],
       [7, 7, 7]])

BROADCASTING

In [67]:
b - np.array([1 , 2, 3])

array([[9, 8, 7],
       [9, 8, 7]])

In [68]:
b / c

array([[5.        , 5.        , 5.        ],
       [1.42857143, 1.42857143, 1.42857143]])

In [69]:
b + 3

array([[13, 13, 13],
       [13, 13, 13]])

In [70]:
b / 2

array([[5., 5., 5.],
       [5., 5., 5.]])

In [71]:
c == 2

array([[ True,  True,  True],
       [False, False, False]])

In [72]:
# Crear 2 array numpy desde height y weight
np_height = np.array(height)
np_weight = np.array(weight)

print(np_weight)
print(np_height)
print(type(np_weight))

[81.65 97.52 95.25 92.98 86.18 88.45]
[1.87 1.87 1.82 1.91 1.9  1.85]
<class 'numpy.ndarray'>

In [73]:
un_bmi = 81.65 / 1.87**2
un_bmi

23.349252194801107

In [74]:
# Calculate bmi
bmi = np_weight / np_height**2

bmi

array([23.34925219, 27.88755755, 28.75558507, 25.48723993, 23.87257618,
       25.84368152])

In [75]:
# For a boolean response
bmi > 23

array([ True,  True,  True,  True,  True,  True])

In [76]:
bmi[[True, True, False, False, False, False]]

array([23.34925219, 27.88755755])

In [77]:
bmi[(bmi > 24) & (bmi < 27)]

array([25.48723993, 25.84368152])

**Funciones de agregacion**:

In [78]:
bmi.sum(), bmi.max(), bmi.min(), bmi.mean(), bmi.cumsum()

(155.1958924497996,
 28.755585074266392,
 23.349252194801107,
 25.8659820749666,
 array([ 23.34925219,  51.23680975,  79.99239482, 105.47963475,
        129.35221093, 155.19589245]))

In [79]:
bmi

array([23.34925219, 27.88755755, 28.75558507, 25.48723993, 23.87257618,
       25.84368152])

In [80]:
bmi.sort()
bmi

array([23.34925219, 23.87257618, 25.48723993, 25.84368152, 27.88755755,
       28.75558507])

In [81]:
d = np.array([[34,33,32,31],[24,23,22,21],[14,13,12,11]])
d

array([[34, 33, 32, 31],
       [24, 23, 22, 21],
       [14, 13, 12, 11]])

In [82]:
d.sort(axis=0)
d

array([[14, 13, 12, 11],
       [24, 23, 22, 21],
       [34, 33, 32, 31]])

In [83]:
d.sort(axis=1)
d

array([[11, 12, 13, 14],
       [21, 22, 23, 24],
       [31, 32, 33, 34]])

**Slicing**

Teniendo a:

In [84]:
a

array([['00', '01', '02', '03'],
       ['10', '11', '12', '13'],
       ['30', '31', '32', '33']], dtype='<U2')

Seleccionar un elemento:

In [85]:
a[1][3] # o a[1,3]

'13'

In [86]:
a[0:2]

array([['00', '01', '02', '03'],
       ['10', '11', '12', '13']], dtype='<U2')

In [87]:
a[0:2, 3]

array(['03', '13'], dtype='<U2')

In [88]:
a[:, 3]

array(['03', '13', '33'], dtype='<U2')

In [89]:
a[:,2:]

array([['02', '03'],
       ['12', '13'],
       ['32', '33']], dtype='<U2')

O una lista de puntos espeficicos...

In [90]:
a[[0,1,1],[2,2,2]]

array(['02', '12', '12'], dtype='<U2')

# Pandas #

- Herramienta de manipulación de datos de alto nivel.
- Desarrollada por Wes McKinney.
- Construido con el paquete Numpy.

## Series ##

In [91]:
import pandas as pd

In [92]:
s1 = pd.Series([3, -5, 7, 4])
print(type(s1))
s1

<class 'pandas.core.series.Series'>

0    3
1   -5
2    7
3    4
dtype: int64

In [93]:
s2 = pd.Series([3, -5, 7, 4], index=['Val A', 'Val B', 'Val C', 'Val D'])
s2

Val A    3
Val B   -5
Val C    7
Val D    4
dtype: int64

## DataFrame ##
Permite almacenar y manipular datos tabulados en **filas de observaciones** y **columnas de variables**.

In [94]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }
dict

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Dehli', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.597, 1.221],
 'population': [200.4, 143.5, 1252, 1357, 52.98]}

In [95]:
brics = pd.DataFrame(dict)

print(type(brics),":")
print(brics)

<class 'pandas.core.frame.DataFrame'> :
        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [96]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [97]:
brics.head(1)

  country   capital   area  population
0  Brazil  Brasilia  8.516       200.4

In [98]:
brics.tail(1)

        country   capital   area  population
4  South Africa  Pretoria  1.221       52.98

In [99]:
brics.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [100]:
brics.columns[3]

'population'

In [101]:
brics['population']

0     200.40
1     143.50
2    1252.00
3    1357.00
4      52.98
Name: population, dtype: float64

In [102]:
brics.describe()

            area   population
count   5.000000     5.000000
mean    7.944000   601.176000
std     6.200557   645.261454
min     1.221000    52.980000
25%     3.286000   143.500000
50%     8.516000   200.400000
75%     9.597000  1252.000000
max    17.100000  1357.000000

In [103]:
brics.describe(include="all")

       country capital       area   population
count        5       5   5.000000     5.000000
unique       5       5        NaN          NaN
top      China  Moscow        NaN          NaN
freq         1       1        NaN          NaN
mean       NaN     NaN   7.944000   601.176000
std        NaN     NaN   6.200557   645.261454
min        NaN     NaN   1.221000    52.980000
25%        NaN     NaN   3.286000   143.500000
50%        NaN     NaN   8.516000   200.400000
75%        NaN     NaN   9.597000  1252.000000
max        NaN     NaN  17.100000  1357.000000

In [104]:
brics['country'].unique()

array(['Brazil', 'Russia', 'India', 'China', 'South Africa'], dtype=object)

In [105]:
brics.sort_values(["capital"], ascending=False)

        country    capital    area  population
4  South Africa   Pretoria   1.221       52.98
2         India  New Dehli   3.286     1252.00
1        Russia     Moscow  17.100      143.50
0        Brazil   Brasilia   8.516      200.40
3         China    Beijing   9.597     1357.00

In [106]:
brics.country.value_counts()

China           1
Brazil          1
Russia          1
India           1
South Africa    1
Name: country, dtype: int64

In [107]:
brics.index = ["BR", "RU", "IN", "CH", "SA"]

brics.index.name = 'C'
brics

         country    capital    area  population
C
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Dehli   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [108]:
brics['density'] = (brics.population / brics.area)
brics.head()

         country    capital    area  population     density
C
BR        Brazil   Brasilia   8.516      200.40   23.532175
RU        Russia     Moscow  17.100      143.50    8.391813
IN         India  New Dehli   3.286     1252.00  381.010347
CH         China    Beijing   9.597     1357.00  141.398354
SA  South Africa   Pretoria   1.221       52.98   43.390663

In [109]:
brics.mean()["area"]

7.944

In [110]:
cars = pd.read_csv('datasets/cars.csv',sep=';', index_col=0)

cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

### Selección de objetos

#### .loc
Esta basado en **etiquetas** o **labels**, pero tambien se puede usar indexación booleana.
`.loc` elevara una excepción `KeyError` cuando no encuentre el elemento en el DF.
Los imputs permitidos son:
 - **label unica**: Ej: 5 or 'a', (5 se interpreta como label del indice (index). Esto no es una posición en el index)
 - **lista o array de labels**: Ej: ['a', 'b', 'c']
 - **slice de labels**: Ej:'a':'f' (A diferencia del slicing de python, este slice incluye principio y fin)
 - **Array booleano**: Ej: [True, False, True] o df['a'] > 0
 - **Una función**
is primarily **label based**, but may also be used with a boolean array. .loc will raise KeyError when the items are not found. Allowed inputs are:

 - A **single label**, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index. This use is not an integer position along the index)
 - A list or **array of labels** ['a', 'b', 'c']
 - A **slice object with labels** 'a':'f' (note that contrary to usual python slices, both the start and the stop are included, when present in the index! - also see Slicing with labels)
 - A **boolean array**
 - A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

In [111]:
# Print out observations for Australia (como una Serie!)
cars.loc['AUS']

cars_per_cap          731
country         Australia
drives_right        False
Name: AUS, dtype: object

In [112]:
# Print out observations for Australia and Egypt (como un nuevo dataframe)
cars.loc[['AUS', 'EG']]

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True

In [113]:
cars.loc[[True, False, True,True, False, True,False]]

     cars_per_cap        country  drives_right
US            809  United States          True
JAP           588          Japan         False
IN             18          India         False
MOR            70        Morocco          True

In [114]:
cars.loc[cars['cars_per_cap'] > 100]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
RU            200         Russia          True

#### .iloc ####
is primarily **integer position based** (from 0 to length-1 of the axis), but may also be used with a boolean array. .iloc will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing. (this conforms with python/numpy slice semantics). Allowed inputs are:

 - An **integer** e.g. 5
 - A list or **ray of integers** [4, 3, 0]
 - A **slice object with ints** 1:7
 - A **boolean array**
 - A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

In [115]:
# Print out observation for Japan (como una serie!)
cars.iloc[6]

cars_per_cap       45
country         Egypt
drives_right     True
Name: EG, dtype: object

In [116]:
# Print out observation for Japan
cars.iloc[[1,6]]

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True

``` 
    df.loc[row_indexer,column_indexer]
    df.iloc[row_indexer,column_indexer]
```
Any of the axes accessors may be the null slice :. **Axes left out of the specification are assumed to be :**. (e.g. p.loc['a'] is equiv to p.loc['a', :, :])

In [117]:
# Print out observation for Japan
cars.loc[['AUS','IN'],['cars_per_cap']]

     cars_per_cap
AUS           731
IN             18

#### Attribute Access ####
Access an index on a Series or column on a DataFrame, directly as an attribute:

In [118]:
# Print out country column as Pandas Series
cars['cars_per_cap']

US     809
AUS    731
JAP    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

In [119]:
print(type(cars['cars_per_cap']))

<class 'pandas.core.series.Series'>

In [120]:
# Print out country column as Pandas DataFrame
cars[['cars_per_cap']]

     cars_per_cap
US            809
AUS           731
JAP           588
IN             18
RU            200
MOR            70
EG             45

In [121]:
# Print out DataFrame with country and drives_right columns
cars[['cars_per_cap', 'country']]

     cars_per_cap        country
US            809  United States
AUS           731      Australia
JAP           588          Japan
IN             18          India
RU            200         Russia
MOR            70        Morocco
EG             45          Egypt

In [122]:
# Print out first 4 observations
cars[0:4]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False

In [123]:
# Print out fifth and sixth observation
cars[4:6]

     cars_per_cap  country  drives_right
RU            200   Russia          True
MOR            70  Morocco          True

In [124]:
cars[cars['cars_per_cap'] > 500]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False

In [125]:
cars.groupby("drives_right").mean()["cars_per_cap"]

drives_right
False    445.666667
True     281.000000
Name: cars_per_cap, dtype: float64

### Para la práctica...

**Resumen de comandos / Cheatsheets**

 - Python: https://s3.amazonaws.com/assets.datacamp.com/blog_assets/PythonForDataScience.pdf
 - NumPy: https://s3.amazonaws.com/assets.datacamp.com/blog_assets/Numpy_Python_Cheat_Sheet.pdf
 - Pandas: https://s3.amazonaws.com/assets.datacamp.com/blog_assets/PandasPythonForDataScience.pdf
 
**Documentación de Pandas**

- https://pandas.pydata.org/pandas-docs/stable/api.html